[Killed] BlockStatement
src/Components/Font-BackComponents/EmailStatus.tsx:12:37
   const [data, setData] = useState([]);
   const navigate = useNavigate();
   useEffect(() => {
-    const fetchEmails = async () => {
-      if (data.length) {
-        return;
-      }
-      try {
-        const token = localStorage.getItem("token");
-        const response = await axios.get(
-          "http://localhost:5005/api/emails/status",
-          {
-            headers: {
-              Authorization: `Bearer ${token}`,
-            },
-          },
-        );
-        if (response.data.success) {
-          setData(response.data.emails);
-        } else {
-          console.error("Failed to fetch emails", response.data.message);
-        }
-      } catch (error) {
-        console.error("Error fetching emails", error);
-      }
-    };
+    const fetchEmails = async () => {};
 
     fetchEmails();
killedBy: EmailStatus Component fetches and displays email data when token is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "/api/emails/status", ObjectContaining {"headers": {"Authorization": StringContaining "mock-token"}}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/Components/Font-BackComponents/EmailStatus.tsx:13:11
   const navigate = useNavigate();
   useEffect(() => {
     const fetchEmails = async () => {
-      if (data.length) {
+      if (true) {
         return;
       }
killedBy: EmailStatus Component fetches and displays email data when token is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "/api/emails/status", ObjectContaining {"headers": {"Authorization": StringContaining "mock-token"}}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Survived] ConditionalExpression
src/Components/Font-BackComponents/EmailStatus.tsx:13:11
   const navigate = useNavigate();
   useEffect(() => {
     const fetchEmails = async () => {
-      if (data.length) {
+      if (false) {
         return;
       }

[Killed] BlockStatement
src/Components/Font-BackComponents/EmailStatus.tsx:16:11
       if (data.length) {
         return;
       }
-      try {
-        const token = localStorage.getItem("token");
-        const response = await axios.get(
-          "http://localhost:5005/api/emails/status",
-          {
-            headers: {
-              Authorization: `Bearer ${token}`,
-            },
-          },
-        );
-        if (response.data.success) {
-          setData(response.data.emails);
-        } else {
-          console.error("Failed to fetch emails", response.data.message);
-        }
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching emails", error);
       }
killedBy: EmailStatus Component fetches and displays email data when token is present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "/api/emails/status", ObjectContaining {"headers": {"Authorization": StringContaining "mock-token"}}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/Components/Font-BackComponents/EmailStatus.tsx:26:13
             },
           },
         );
-        if (response.data.success) {
+        if (false) {
           setData(response.data.emails);
         } else {
killedBy: EmailStatus Component fetches and displays email data when token is present
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2 items
Received:
  0 items

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/Components/Font-BackComponents/EmailStatus.tsx:26:36
             },
           },
         );
-        if (response.data.success) {
-          setData(response.data.emails);
-        } else {
+        if (response.data.success) {} else {
           console.error("Failed to fetch emails", response.data.message);
         }
killedBy: EmailStatus Component fetches and displays email data when token is present
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2 items
Received:
  0 items

Ignored nodes: comments, script, style

[NoCoverage] BlockStatement
src/Components/Font-BackComponents/EmailStatus.tsx:28:16
         );
         if (response.data.success) {
           setData(response.data.emails);
-        } else {
-          console.error("Failed to fetch emails", response.data.message);
-        }
+        } else {}
       } catch (error) {
         console.error("Error fetching emails", error);

[NoCoverage] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:29:25
         if (response.data.success) {
           setData(response.data.emails);
         } else {
-          console.error("Failed to fetch emails", response.data.message);
+          console.error("", response.data.message);
         }
       } catch (error) {

[Killed] BlockStatement
src/Components/Font-BackComponents/EmailStatus.tsx:31:23
         } else {
           console.error("Failed to fetch emails", response.data.message);
         }
-      } catch (error) {
-        console.error("Error fetching emails", error);
-      }
+      } catch (error) {}
     };
 
killedBy: EmailStatus Component handles API error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching emails", Any<Error>

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:32:23
           console.error("Failed to fetch emails", response.data.message);
         }
       } catch (error) {
-        console.error("Error fetching emails", error);
+        console.error("", error);
       }
     };
killedBy: EmailStatus Component handles API error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching emails", Any<Error>
Received: "", [Error: API Error]

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/Components/Font-BackComponents/EmailStatus.tsx:39:7
     fetchEmails();
   }, []);
 
-  if (!localStorage.getItem("token")) {
+  if (true) {
     console.error("No token found in localStorage");
     return (
killedBy: EmailStatus Component fetches and displays email data when token is present
statusReason: Error: Unable to find an element by: [data-testid="dynamic-table"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBox-root css-0"
    >

[Killed] BlockStatement
src/Components/Font-BackComponents/EmailStatus.tsx:39:39
     fetchEmails();
   }, []);
 
-  if (!localStorage.getItem("token")) {
-    console.error("No token found in localStorage");
-    return (
-      <Box>
-        <Typography variant="h4" color="red">
-          Please login to view email status.
-        </Typography>
-      </Box>
-    );
-  }
+  if (!localStorage.getItem("token")) {}
   return (
     <>
killedBy: EmailStatus Component shows login required message when no token is present
statusReason: TestingLibraryElementError: Unable to find an element with the text: /please login to view email status/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiToolbar-root MuiToolbar-gutters MuiToolbar-regul

[Survived] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:40:19
   }, []);
 
   if (!localStorage.getItem("token")) {
-    console.error("No token found in localStorage");
+    console.error("");
     return (
       <Box>

[Survived] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:55:17
     <Box
       sx={{
         display: "flex",
-        height: "100vh",
+        height: "",
         width: "100vw",
         flexDirection: "column",

[Survived] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:61:26
         alignItems: "center",
         justifyContent: "center",
         padding: 2,
-        backgroundColor: "grey",
+        backgroundColor: "",
         
       }}

[Survived] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:65:29
         
       }}
     >
-      <Box sx={{ alignSelf: "flex-start" }}>
+      <Box sx={{ alignSelf: "" }}>
         <Button
           variant="contained"

[Survived] StringLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:68:24
       <Box sx={{ alignSelf: "flex-start" }}>
         <Button
           variant="contained"
-          sx={{ color: "white", margin: 2 }}
+          sx={{ color: "", margin: 2 }}
           onClick={() => navigate("/upload-emails")}
         >

[Survived] ObjectLiteral
src/Components/Font-BackComponents/EmailStatus.tsx:68:15
       <Box sx={{ alignSelf: "flex-start" }}>
         <Button
           variant="contained"
-          sx={{ color: "white", margin: 2 }}
+          sx={{}}
           onClick={() => navigate("/upload-emails")}
         >

[Killed] ArrowFunction
src/Components/Font-BackComponents/EmailStatus.tsx:69:20
         <Button
           variant="contained"
           sx={{ color: "white", margin: 2 }}
-          onClick={() => navigate("/upload-emails")}
+          onClick={() => undefined}
         >
           Back to Dashboard
killedBy: EmailStatus Component navigates back to dashboard when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/upload-emails"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
