[NoCoverage] BlockStatement
frontend/src/App.tsx:7:16
 import { AuthProvider } from "./Contexts/AuthContext";
 import "./App.css";
 
-function App() {
-	const router = createRoutes();
-
-	return (
-		<AuthProvider>
-			<RouterProvider router={router} />
-		</AuthProvider>
-	);
-}
+function App() {}
 
 export default App;
