[NoCoverage] BlockStatement
src/Components/Font-BackComponents/UploadEmails.tsx:11:72
   const [file, setFile] = useState<File | null>(null);
   const [message, setMessage] = useState("");
 
-  const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
-      setFile(e.target.files[0]);
-    }
-  };
+  const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const handleSubmit = async (e: React.FormEvent) => {

[NoCoverage] ConditionalExpression
src/Components/Font-BackComponents/UploadEmails.tsx:12:9
   const [message, setMessage] = useState("");
 
   const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
+    if (true) {
       setFile(e.target.files[0]);
     }

[NoCoverage] ConditionalExpression
src/Components/Font-BackComponents/UploadEmails.tsx:12:27
   const [message, setMessage] = useState("");
 
   const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    if (e.target.files && e.target.files.length > 0) {
+    if (e.target.files && true) {
       setFile(e.target.files[0]);
     }

[NoCoverage] ConditionalExpression
src/Components/Font-BackComponents/UploadEmails.tsx:21:9
     e.preventDefault();
 
     const formData = new FormData();
-    if (file) {
+    if (false) {
       formData.append("file", file);
     }

[NoCoverage] BlockStatement
src/Components/Font-BackComponents/UploadEmails.tsx:21:15
     e.preventDefault();
 
     const formData = new FormData();
-    if (file) {
-      formData.append("file", file);
-    }
+    if (file) {}
     if (email.trim()) {
       formData.append("email", email.trim());

[NoCoverage] BlockStatement
src/Components/Font-BackComponents/UploadEmails.tsx:24:23
     if (file) {
       formData.append("file", file);
     }
-    if (email.trim()) {
-      formData.append("email", email.trim());
-    }
+    if (email.trim()) {}
 
     try {

[NoCoverage] MethodExpression
src/Components/Font-BackComponents/UploadEmails.tsx:24:9
     if (file) {
       formData.append("file", file);
     }
-    if (email.trim()) {
+    if (email) {
       formData.append("email", email.trim());
     }

[NoCoverage] MethodExpression
src/Components/Font-BackComponents/UploadEmails.tsx:25:32
       formData.append("file", file);
     }
     if (email.trim()) {
-      formData.append("email", email.trim());
+      formData.append("email", email);
     }
 

[NoCoverage] BlockStatement
src/Components/Font-BackComponents/UploadEmails.tsx:28:9
       formData.append("email", email.trim());
     }
 
-    try {
-      const token = localStorage.getItem("token"); // Adjust token retrieval as needed
-      const response = await axios.post(
-        "http://localhost:5005/api/emails/upload-emails",
-        formData,
-        {
-          headers: {
-            "Content-Type": "multipart/form-data",
-            Authorization: `Bearer ${token}`,
-          },
-        }
-      );
-      setMessage(response.data.message);
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.error("Error uploading emails:", error);
       setMessage("Error uploading emails");

[NoCoverage] ObjectLiteral
src/Components/Font-BackComponents/UploadEmails.tsx:33:9
       const response = await axios.post(
         "http://localhost:5005/api/emails/upload-emails",
         formData,
-        {
-          headers: {
-            "Content-Type": "multipart/form-data",
-            Authorization: `Bearer ${token}`,
-          },
-        }
+        {}
       );
       setMessage(response.data.message);

[NoCoverage] ObjectLiteral
src/Components/Font-BackComponents/UploadEmails.tsx:34:20
         "http://localhost:5005/api/emails/upload-emails",
         formData,
         {
-          headers: {
-            "Content-Type": "multipart/form-data",
-            Authorization: `Bearer ${token}`,
-          },
+          headers: {},
         }
       );

[NoCoverage] BlockStatement
src/Components/Font-BackComponents/UploadEmails.tsx:41:26
         }
       );
       setMessage(response.data.message);
-    } catch (error: any) {
-      console.error("Error uploading emails:", error);
-      setMessage("Error uploading emails");
-    }
+    } catch (error: any) {}
   };
 

[NoCoverage] ArrowFunction
src/Components/Font-BackComponents/UploadEmails.tsx:53:26
    <h1>Upload Emails</h1>
       <form onSubmit={handleSubmit}>
         
-        <input onChange={(e) => setEmail(e.target.value)}
+        <input onChange={() => undefined}
         placeholder="Enter email address" />
               <input

[NoCoverage] LogicalOperator
src/Components/Font-BackComponents/UploadEmails.tsx:65:8
             <button type="submit">Upload</button>
             
       </form>
-      {message && (
-        <p>{message}</p>
-      )}
+      {message || <p>{message}</p>}
     </div>
     </>

[NoCoverage] ConditionalExpression
src/Components/Font-BackComponents/UploadEmails.tsx:65:8
             <button type="submit">Upload</button>
             
       </form>
-      {message && (
-        <p>{message}</p>
-      )}
+      {false}
     </div>
     </>
