[Survived] BooleanLiteral
frontend/src/Components/Navigation.tsx:21:48
 import { useNavigate } from "react-router-dom";
 
 const Navigation = () => {
-  const [openDrawer, setOpenDrawer] = useState(false);
+  const [openDrawer, setOpenDrawer] = useState(true);
   const navigate = useNavigate();
 

[Survived] ArrowFunction
frontend/src/Components/Navigation.tsx:25:5
   const navigate = useNavigate();
 
   const toggleDrawer =
-    (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {
-      if (
-        event.type === "keydown" &&
-        ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
-      ) {
-        return;
-      }
-      setOpenDrawer(isOpen);
-    };
+    () => undefined;
 
   const handleNavigation = (path: string) => {

[NoCoverage] BlockStatement
frontend/src/Components/Navigation.tsx:25:77
   const navigate = useNavigate();
 
   const toggleDrawer =
-    (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {
-      if (
-        event.type === "keydown" &&
-        ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
-      ) {
-        return;
-      }
-      setOpenDrawer(isOpen);
-    };
+    (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {};
 
   const handleNavigation = (path: string) => {

[NoCoverage] ConditionalExpression
frontend/src/Components/Navigation.tsx:27:9
   const toggleDrawer =
     (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {
       if (
-        event.type === "keydown" &&
-        ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
+        false
       ) {
         return;

[NoCoverage] LogicalOperator
frontend/src/Components/Navigation.tsx:27:9
   const toggleDrawer =
     (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {
       if (
-        event.type === "keydown" &&
-        ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
+        event.type === "keydown" || (event as React.KeyboardEvent).key === "Tab" || (event as React.KeyboardEvent).key === "Shift"
       ) {
         return;

[NoCoverage] ConditionalExpression
frontend/src/Components/Navigation.tsx:28:10
     (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {
       if (
         event.type === "keydown" &&
-        ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
+        (true)
       ) {
         return;

[NoCoverage] LogicalOperator
frontend/src/Components/Navigation.tsx:28:10
     (isOpen: boolean) => (event: React.KeyboardEvent | React.MouseEvent) => {
       if (
         event.type === "keydown" &&
-        ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
+        ((event as React.KeyboardEvent).key === "Tab" && (event as React.KeyboardEvent).key === "Shift")
       ) {
         return;

[NoCoverage] EqualityOperator
frontend/src/Components/Navigation.tsx:29:11
       if (
         event.type === "keydown" &&
         ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
+          (event as React.KeyboardEvent).key !== "Shift")
       ) {
         return;

[NoCoverage] ConditionalExpression
frontend/src/Components/Navigation.tsx:29:11
       if (
         event.type === "keydown" &&
         ((event as React.KeyboardEvent).key === "Tab" ||
-          (event as React.KeyboardEvent).key === "Shift")
+          false)
       ) {
         return;

[NoCoverage] BlockStatement
frontend/src/Components/Navigation.tsx:30:9
         event.type === "keydown" &&
         ((event as React.KeyboardEvent).key === "Tab" ||
           (event as React.KeyboardEvent).key === "Shift")
-      ) {
-        return;
-      }
+      ) {}
       setOpenDrawer(isOpen);
     };

[NoCoverage] BlockStatement
frontend/src/Components/Navigation.tsx:36:46
       setOpenDrawer(isOpen);
     };
 
-  const handleNavigation = (path: string) => {
-    navigate(path);
-    setOpenDrawer(false);
-  };
+  const handleNavigation = (path: string) => {};
 
   return (

[NoCoverage] BooleanLiteral
frontend/src/Components/Navigation.tsx:38:19
 
   const handleNavigation = (path: string) => {
     navigate(path);
-    setOpenDrawer(false);
+    setOpenDrawer(true);
   };
 

[Survived] ObjectLiteral
frontend/src/Components/Navigation.tsx:44:13
   return (
     <>
       <Toolbar
-        sx={{
-          position: "fixed",
-          top: 0,
-          left: 0,
-          right: 0,
-          zIndex: (theme) => theme.zIndex.drawer + 1,
-          background: "linear-gradient(135deg, #ADD8E6, #FF69B4)",
-          borderRadius: 2,
-          padding: "0 20px",
-          boxShadow: "none",
-          width: "100vw",
-        }}
+        sx={{}}
       >
         <IconButton

[Survived] ArithmeticOperator
frontend/src/Components/Navigation.tsx:49:30
           top: 0,
           left: 0,
           right: 0,
-          zIndex: (theme) => theme.zIndex.drawer + 1,
+          zIndex: (theme) => theme.zIndex.drawer - 1,
           background: "linear-gradient(135deg, #ADD8E6, #FF69B4)",
           borderRadius: 2,

[Survived] ArrowFunction
frontend/src/Components/Navigation.tsx:49:19
           top: 0,
           left: 0,
           right: 0,
-          zIndex: (theme) => theme.zIndex.drawer + 1,
+          zIndex: () => undefined,
           background: "linear-gradient(135deg, #ADD8E6, #FF69B4)",
           borderRadius: 2,

[Survived] StringLiteral
frontend/src/Components/Navigation.tsx:52:20
           zIndex: (theme) => theme.zIndex.drawer + 1,
           background: "linear-gradient(135deg, #ADD8E6, #FF69B4)",
           borderRadius: 2,
-          padding: "0 20px",
+          padding: "",
           boxShadow: "none",
           width: "100vw",

[Survived] StringLiteral
frontend/src/Components/Navigation.tsx:54:18
           borderRadius: 2,
           padding: "0 20px",
           boxShadow: "none",
-          width: "100vw",
+          width: "",
         }}
       >

[Survived] BooleanLiteral
frontend/src/Components/Navigation.tsx:62:33
           color="inherit"
           aria-label="menu"
           sx={{ mr: 2 }}
-          onClick={toggleDrawer(true)}
+          onClick={toggleDrawer(false)}
         >
           <MenuIcon />

[Survived] BooleanLiteral
frontend/src/Components/Navigation.tsx:73:31
       <Drawer
         anchor="left"
         open={openDrawer}
-        onClose={toggleDrawer(false)}
+        onClose={toggleDrawer(true)}
         PaperProps={{
           sx: {

[Survived] ObjectLiteral
frontend/src/Components/Navigation.tsx:75:15
         open={openDrawer}
         onClose={toggleDrawer(false)}
         PaperProps={{
-          sx: {
-            background: "linear-gradient(135deg, #ADD8E6, #FF69B4)",
-          },
+          sx: {},
         }}
       >

[Survived] ArrowFunction
frontend/src/Components/Navigation.tsx:84:38
         <Toolbar />
         <List sx={{ width: 250 }}>
           <ListItem disablePadding>
-            <ListItemButton onClick={() => handleNavigation("/")}>
+            <ListItemButton onClick={() => undefined}>
               <ListItemIcon>
                 <HomeIcon />

[Survived] ArrowFunction
frontend/src/Components/Navigation.tsx:92:38
             </ListItemButton>
           </ListItem>
           <ListItem disablePadding>
-            <ListItemButton onClick={() => handleNavigation("/upload-emails")}>
+            <ListItemButton onClick={() => undefined}>
               <ListItemIcon>
                 <UploadIcon />

[Survived] ArrowFunction
frontend/src/Components/Navigation.tsx:100:38
             </ListItemButton>
           </ListItem>
           <ListItem disablePadding>
-            <ListItemButton onClick={() => handleNavigation("/status")}>
+            <ListItemButton onClick={() => undefined}>
               <ListItemIcon>
                 <EmailIcon />

[NoCoverage] StringLiteral
frontend/src/Components/Navigation.tsx:100:61
             </ListItemButton>
           </ListItem>
           <ListItem disablePadding>
-            <ListItemButton onClick={() => handleNavigation("/status")}>
+            <ListItemButton onClick={() => handleNavigation("")}>
               <ListItemIcon>
                 <EmailIcon />
