[NoCoverage] StringLiteral
src/Components/Login/Login.tsx:11:19
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
   const [message, setMessage] = useState("");
-  const baseUrl = "http://localhost:5005/api/auth"; // Base URL for the backend
+  const baseUrl = ""; // Base URL for the backend
   const navigate = useNavigate();
   const { loggedIn, login, logout } = useAuth();

[NoCoverage] BlockStatement
src/Components/Login/Login.tsx:18:17
 login();
 
  console.log("Logged in status:", loggedIn);
-  if (loggedIn) {
-    navigate("/upload-emails");
-  }
+  if (loggedIn) {}
   // Login function now sends email and password to the backend
 

[NoCoverage] ConditionalExpression
src/Components/Login/Login.tsx:18:7
 login();
 
  console.log("Logged in status:", loggedIn);
-  if (loggedIn) {
+  if (true) {
     navigate("/upload-emails");
   }

[NoCoverage] BlockStatement
src/Components/Login/Login.tsx:23:35
   }
   // Login function now sends email and password to the backend
 
-  const handleLogin = async () => {
-    try {
-      const response = await fetch(`${baseUrl}/login`, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ email, password }),
-      });
-      const data = await response.json();
-      if (response.ok || data.token) {
-        setMessage("Login successful!");
-        // You can also store the token in localStorage or context for later use
-        localStorage.setItem("token", data.token);
-        login();
-        navigate("/upload-emails");
-      } else {
-        setMessage(data.message || "Login failed. Please try again.");
-      }
-    } catch (error) {
-      setMessage("An error occurred during login. Please try again.");
-    } 
-    
-  };
+  const handleLogin = async () => {};
 
   return (

[NoCoverage] BlockStatement
src/Components/Login/Login.tsx:24:9
   // Login function now sends email and password to the backend
 
   const handleLogin = async () => {
-    try {
-      const response = await fetch(`${baseUrl}/login`, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ email, password }),
-      });
-      const data = await response.json();
-      if (response.ok || data.token) {
-        setMessage("Login successful!");
-        // You can also store the token in localStorage or context for later use
-        localStorage.setItem("token", data.token);
-        login();
-        navigate("/upload-emails");
-      } else {
-        setMessage(data.message || "Login failed. Please try again.");
-      }
-    } catch (error) {
+    try {} catch (error) {
       setMessage("An error occurred during login. Please try again.");
     } 

[NoCoverage] ObjectLiteral
src/Components/Login/Login.tsx:25:56
 
   const handleLogin = async () => {
     try {
-      const response = await fetch(`${baseUrl}/login`, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ email, password }),
-      });
+      const response = await fetch(`${baseUrl}/login`, {});
       const data = await response.json();
       if (response.ok || data.token) {

[NoCoverage] ConditionalExpression
src/Components/Login/Login.tsx:31:11
         body: JSON.stringify({ email, password }),
       });
       const data = await response.json();
-      if (response.ok || data.token) {
+      if (true) {
         setMessage("Login successful!");
         // You can also store the token in localStorage or context for later use

[NoCoverage] LogicalOperator
src/Components/Login/Login.tsx:31:11
         body: JSON.stringify({ email, password }),
       });
       const data = await response.json();
-      if (response.ok || data.token) {
+      if (response.ok && data.token) {
         setMessage("Login successful!");
         // You can also store the token in localStorage or context for later use

[NoCoverage] StringLiteral
src/Components/Login/Login.tsx:32:20
       });
       const data = await response.json();
       if (response.ok || data.token) {
-        setMessage("Login successful!");
+        setMessage("");
         // You can also store the token in localStorage or context for later use
         localStorage.setItem("token", data.token);

[NoCoverage] BlockStatement
src/Components/Login/Login.tsx:37:14
         localStorage.setItem("token", data.token);
         login();
         navigate("/upload-emails");
-      } else {
-        setMessage(data.message || "Login failed. Please try again.");
-      }
+      } else {}
     } catch (error) {
       setMessage("An error occurred during login. Please try again.");

[NoCoverage] LogicalOperator
src/Components/Login/Login.tsx:38:20
         login();
         navigate("/upload-emails");
       } else {
-        setMessage(data.message || "Login failed. Please try again.");
+        setMessage(data.message && "Login failed. Please try again.");
       }
     } catch (error) {

[NoCoverage] ConditionalExpression
src/Components/Login/Login.tsx:38:20
         login();
         navigate("/upload-emails");
       } else {
-        setMessage(data.message || "Login failed. Please try again.");
+        setMessage(false);
       }
     } catch (error) {

[NoCoverage] BlockStatement
src/Components/Login/Login.tsx:40:21
       } else {
         setMessage(data.message || "Login failed. Please try again.");
       }
-    } catch (error) {
-      setMessage("An error occurred during login. Please try again.");
-    } 
+    } catch (error) {} 
     
   };

[NoCoverage] ArrowFunction
src/Components/Login/Login.tsx:73:20
         </button>
         <button
           className="register-button"
-          onClick={() => navigate("/register")}
+          onClick={() => undefined}
         >
           Register
