[NoCoverage] StringLiteral
src/Components/Register/Register.tsx:10:42
   const [username, setUsername] = useState("");
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
-  const [message, setMessage] = useState("");
+  const [message, setMessage] = useState("Stryker was here!");
   const baseUrl = "http://localhost:5005/api"; // Base URL for the backend
   const navigate = useNavigate();

[NoCoverage] StringLiteral
src/Components/Register/Register.tsx:11:19
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
   const [message, setMessage] = useState("");
-  const baseUrl = "http://localhost:5005/api"; // Base URL for the backend
+  const baseUrl = ""; // Base URL for the backend
   const navigate = useNavigate();
   // Registration sends username, email, and password to the backend

[NoCoverage] BlockStatement
src/Components/Register/Register.tsx:14:38
   const baseUrl = "http://localhost:5005/api"; // Base URL for the backend
   const navigate = useNavigate();
   // Registration sends username, email, and password to the backend
-  const handleRegister = async () => {
-    try {
-      const response = await fetch(`${baseUrl}/auth/register`, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ username, email, password }),
-      });
-      const data = await response.json();
-      console.log("Registration response:", data);
-
-      if (response.ok) {
-        setMessage(data.message || "Registration successful!");
-        
-      } else {
-        setMessage(data.message || "Registration failed. Please try again.");
-      }
-    } catch (error) {
-      setMessage("An error occurred during registration. Please try again.");
-    }
-  };
+  const handleRegister = async () => {};
 
   return (

[NoCoverage] BlockStatement
src/Components/Register/Register.tsx:15:9
   const navigate = useNavigate();
   // Registration sends username, email, and password to the backend
   const handleRegister = async () => {
-    try {
-      const response = await fetch(`${baseUrl}/auth/register`, {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({ username, email, password }),
-      });
-      const data = await response.json();
-      console.log("Registration response:", data);
-
-      if (response.ok) {
-        setMessage(data.message || "Registration successful!");
-        
-      } else {
-        setMessage(data.message || "Registration failed. Please try again.");
-      }
-    } catch (error) {
+    try {} catch (error) {
       setMessage("An error occurred during registration. Please try again.");
     }

[NoCoverage] StringLiteral
src/Components/Register/Register.tsx:17:17
   const handleRegister = async () => {
     try {
       const response = await fetch(`${baseUrl}/auth/register`, {
-        method: "POST",
+        method: "",
         headers: { "Content-Type": "application/json" },
         body: JSON.stringify({ username, email, password }),

[NoCoverage] StringLiteral
src/Components/Register/Register.tsx:22:19
         body: JSON.stringify({ username, email, password }),
       });
       const data = await response.json();
-      console.log("Registration response:", data);
+      console.log("", data);
 
       if (response.ok) {

[NoCoverage] ConditionalExpression
src/Components/Register/Register.tsx:25:20
       console.log("Registration response:", data);
 
       if (response.ok) {
-        setMessage(data.message || "Registration successful!");
+        setMessage(false);
         
       } else {

[NoCoverage] LogicalOperator
src/Components/Register/Register.tsx:25:20
       console.log("Registration response:", data);
 
       if (response.ok) {
-        setMessage(data.message || "Registration successful!");
+        setMessage(data.message && "Registration successful!");
         
       } else {

[NoCoverage] BlockStatement
src/Components/Register/Register.tsx:27:14
       if (response.ok) {
         setMessage(data.message || "Registration successful!");
         
-      } else {
-        setMessage(data.message || "Registration failed. Please try again.");
-      }
+      } else {}
     } catch (error) {
       setMessage("An error occurred during registration. Please try again.");

[NoCoverage] ConditionalExpression
src/Components/Register/Register.tsx:28:20
         setMessage(data.message || "Registration successful!");
         
       } else {
-        setMessage(data.message || "Registration failed. Please try again.");
+        setMessage(true);
       }
     } catch (error) {

[NoCoverage] LogicalOperator
src/Components/Register/Register.tsx:28:20
         setMessage(data.message || "Registration successful!");
         
       } else {
-        setMessage(data.message || "Registration failed. Please try again.");
+        setMessage(data.message && "Registration failed. Please try again.");
       }
     } catch (error) {

[NoCoverage] BlockStatement
src/Components/Register/Register.tsx:30:21
       } else {
         setMessage(data.message || "Registration failed. Please try again.");
       }
-    } catch (error) {
-      setMessage("An error occurred during registration. Please try again.");
-    }
+    } catch (error) {}
   };
 

[NoCoverage] StringLiteral
src/Components/Register/Register.tsx:31:18
         setMessage(data.message || "Registration failed. Please try again.");
       }
     } catch (error) {
-      setMessage("An error occurred during registration. Please try again.");
+      setMessage("");
     }
   };

[NoCoverage] StringLiteral
src/Components/Register/Register.tsx:50:23
           marginTop: 8,
           display: "flex",
           flexDirection: "column",
-          alignItems: "center"
+          alignItems: ""
         }}
       >

[NoCoverage] ArrowFunction
src/Components/Register/Register.tsx:61:23
             label="Username"
             variant="outlined"
             value={username}
-            onChange={(e) => setUsername(e.target.value)}
+            onChange={() => undefined}
             fullWidth
             margin="normal"

[NoCoverage] ArrowFunction
src/Components/Register/Register.tsx:78:23
             type="password"
             variant="outlined"
             value={password}
-            onChange={(e) => setPassword(e.target.value)}
+            onChange={() => undefined}
             fullWidth
             margin="normal"

[NoCoverage] ObjectLiteral
src/Components/Register/Register.tsx:87:17
             color="primary"
             onClick={handleRegister}
             fullWidth
-            sx={{ mt: 2 }}
+            sx={{}}
           >
             Register

[NoCoverage] LogicalOperator
src/Components/Register/Register.tsx:91:12
           >
             Register
           </Button>
-          {message && (
-            <Typography variant="body1" align="center" sx={{ mt: 2 }}>
-              {message}
-            </Typography>
-          )}
+          {message || <Typography variant="body1" align="center" sx={{
+  mt: 2
+}}>
+              {message}
+            </Typography>}
           <Typography variant="body1" align="center" sx={{ mt: 2 }}>
             Please register to continue.

[NoCoverage] ConditionalExpression
src/Components/Register/Register.tsx:91:12
           >
             Register
           </Button>
-          {message && (
-            <Typography variant="body1" align="center" sx={{ mt: 2 }}>
-              {message}
-            </Typography>
-          )}
+          {false}
           <Typography variant="body1" align="center" sx={{ mt: 2 }}>
             Please register to continue.
