[NoCoverage] BlockStatement
frontend/src/Contexts/AuthContext.tsx:11:72
 
 const AuthContext = createContext<AuthContextType | undefined>(undefined);
 
-export const AuthProvider = ({ children }: { children: ReactNode }) => {
-	const [loggedIn, setLoggedIn] = useState(false);
-
-	const login = () => setLoggedIn(true);
-	const logout = () => setLoggedIn(false);
-
-	return (
-		<AuthContext.Provider value={{ loggedIn, login, logout }}>{children}</AuthContext.Provider>
-	);
-};
+export const AuthProvider = ({ children }: { children: ReactNode }) => {};
 
 export const useAuth = () => {

[NoCoverage] BooleanLiteral
frontend/src/Contexts/AuthContext.tsx:12:43
 const AuthContext = createContext<AuthContextType | undefined>(undefined);
 
 export const AuthProvider = ({ children }: { children: ReactNode }) => {
-	const [loggedIn, setLoggedIn] = useState(false);
+	const [loggedIn, setLoggedIn] = useState(true);
 
 	const login = () => setLoggedIn(true);

[NoCoverage] ArrowFunction
frontend/src/Contexts/AuthContext.tsx:14:16
 export const AuthProvider = ({ children }: { children: ReactNode }) => {
 	const [loggedIn, setLoggedIn] = useState(false);
 
-	const login = () => setLoggedIn(true);
+	const login = () => undefined;
 	const logout = () => setLoggedIn(false);
 

[NoCoverage] BooleanLiteral
frontend/src/Contexts/AuthContext.tsx:14:34
 export const AuthProvider = ({ children }: { children: ReactNode }) => {
 	const [loggedIn, setLoggedIn] = useState(false);
 
-	const login = () => setLoggedIn(true);
+	const login = () => setLoggedIn(false);
 	const logout = () => setLoggedIn(false);
 

[NoCoverage] ArrowFunction
frontend/src/Contexts/AuthContext.tsx:15:17
 	const [loggedIn, setLoggedIn] = useState(false);
 
 	const login = () => setLoggedIn(true);
-	const logout = () => setLoggedIn(false);
+	const logout = () => undefined;
 
 	return (

[NoCoverage] BooleanLiteral
frontend/src/Contexts/AuthContext.tsx:15:35
 	const [loggedIn, setLoggedIn] = useState(false);
 
 	const login = () => setLoggedIn(true);
-	const logout = () => setLoggedIn(false);
+	const logout = () => setLoggedIn(true);
 
 	return (

[NoCoverage] BlockStatement
frontend/src/Contexts/AuthContext.tsx:22:30
 	);
 };
 
-export const useAuth = () => {
-	const context = useContext(AuthContext);
-	if (!context) {
-		throw new Error("useAuth must be used within an AuthProvider");
-	}
-	return context;
-};
+export const useAuth = () => {};
 

[NoCoverage] StringLiteral
frontend/src/Contexts/AuthContext.tsx:25:19
 export const useAuth = () => {
 	const context = useContext(AuthContext);
 	if (!context) {
-		throw new Error("useAuth must be used within an AuthProvider");
+		throw new Error("");
 	}
 	return context;
