[NoCoverage] BlockStatement
frontend/src/Pages/ErrorPage.tsx:1:25
-const ErrorPage = () => {
-
-    return (
-        <div>
-            <h1>404 Not Found</h1>
-        </div>
-    )
-};
+const ErrorPage = () => {};
 
 export default ErrorPage;
