[NoCoverage] BlockStatement
frontend/src/Pages/Root.tsx:6:20
 
 // Outlet if we need it
 
-const Root = () => {
-  return (
-    <>
-        {/* Header? */}
-        <Outlet />
-        {/* Footer? */}
-         </>
-  );
-};
+const Root = () => {};
 
 export default Root;
