[NoCoverage] ArrowFunction
src/Pages/TestPage/TestPage.tsx:7:31
 import { decrement, increment, incrementByAmount, updateNumber } from "../../Store/countSlice";
 import "./TestPage.css";
 const TestPage = () => {
-    const count = useSelector((state: RootState) => state.state.count);
+    const count = useSelector(() => undefined);
     const number = useSelector((state: RootState) => state.state.number);
    

[NoCoverage] ArrowFunction
src/Pages/TestPage/TestPage.tsx:8:32
 import "./TestPage.css";
 const TestPage = () => {
     const count = useSelector((state: RootState) => state.state.count);
-    const number = useSelector((state: RootState) => state.state.number);
+    const number = useSelector(() => undefined);
    
     const dispatch = useAppDispatch();

[NoCoverage] ArrowFunction
src/Pages/TestPage/TestPage.tsx:20:24
         <h1 className="title">Count: {count}</h1>
         <p className="description">I set up React Redux and some basic routing to give us some kinda starting ground for the project 😊 </p>
         
-      <button onClick={() => dispatch(increment())}>Increase by 1</button>
+      <button onClick={() => undefined}>Increase by 1</button>
       <button onClick={() => dispatch(decrement())}>Decrease by 1</button>
       <button onClick={() => dispatch(incrementByAmount(number))}>

[NoCoverage] ArrowFunction
src/Pages/TestPage/TestPage.tsx:21:24
         <p className="description">I set up React Redux and some basic routing to give us some kinda starting ground for the project 😊 </p>
         
       <button onClick={() => dispatch(increment())}>Increase by 1</button>
-      <button onClick={() => dispatch(decrement())}>Decrease by 1</button>
+      <button onClick={() => undefined}>Decrease by 1</button>
       <button onClick={() => dispatch(incrementByAmount(number))}>
                     Increase by: {number}

[NoCoverage] ArrowFunction
src/Pages/TestPage/TestPage.tsx:22:24
         
       <button onClick={() => dispatch(increment())}>Increase by 1</button>
       <button onClick={() => dispatch(decrement())}>Decrease by 1</button>
-      <button onClick={() => dispatch(incrementByAmount(number))}>
+      <button onClick={() => undefined}>
                     Increase by: {number}
                 </button>

[NoCoverage] ArrowFunction
src/Pages/TestPage/TestPage.tsx:29:31
                 <input
                     type="number"
                     value={number}
-                    onChange={(e) => dispatch(updateNumber(Number(e.target.value)))}
+                    onChange={() => undefined}
                     placeholder="Enter a number"
                 />
