[NoCoverage] BlockStatement
frontend/src/Routes/appRoutes.tsx:9:69
 import Register from "../Components/Register/Register";
 import UploadEmails from "../Components/Font-BackComponents/UploadEmails";
 import EmailStatus from "../Components/Font-BackComponents/EmailStatus";
-const ProtectedRoute = ({ children }: { children: JSX.Element }) => {
-	const { loggedIn } = useAuth();
-	return loggedIn ? children : <Login />;
-};
+const ProtectedRoute = ({ children }: { children: JSX.Element }) => {};
 
 const routes: RouteObject[] = [

[NoCoverage] StringLiteral
frontend/src/Routes/appRoutes.tsx:37:9
 		element: <Register />,
 	},
 	{
-		path: "/upload-emails",
+		path: "",
 
 		element: (

[NoCoverage] ArrowFunction
frontend/src/Routes/appRoutes.tsx:55:22
 	},
 ];
 
-const createRoutes = () => createBrowserRouter(routes);
+const createRoutes = () => undefined;
 
 export default createRoutes;
