[Killed] BlockStatement
src/Components/Overlay/Overlay.tsx:3:23
 import React from "react";
 
-const Overlay = () => {
-	return (
-		<div className="overlay">
-			<p>Overlay</p>
-		</div>
-	);
-};
+const Overlay = () => {};
 
 export default Overlay;
killedBy: Overlay renders overlay text
statusReason: TestingLibraryElementError: Unable to find an element with the text: Overlay. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
