[Killed] BlockStatement
src/Components/TestingExampleComponent/TestingExampleComponent.tsx:3:39
 import React from "react";
 
-const TestingExampleComponent = () => {
-	const sum = (a: number, b: number) => {
-		return a + b;
-	};
-
-	return (
-		<div className="result">
-			<p>{sum(1, 2)}</p>
-		</div>
-	);
-};
+const TestingExampleComponent = () => {};
 
 export default TestingExampleComponent;
killedBy: TestingExampleComponent displays the correct sum result
statusReason: TestingLibraryElementError: Unable to find an element with the text: 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/Components/TestingExampleComponent/TestingExampleComponent.tsx:4:40
 import React from "react";
 
 const TestingExampleComponent = () => {
-	const sum = (a: number, b: number) => {
-		return a + b;
-	};
+	const sum = (a: number, b: number) => {};
 
 	return (
killedBy: TestingExampleComponent displays the correct sum result
statusReason: TestingLibraryElementError: Unable to find an element with the text: 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="result"
    >

[Killed] ArithmeticOperator
src/Components/TestingExampleComponent/TestingExampleComponent.tsx:5:10
 
 const TestingExampleComponent = () => {
 	const sum = (a: number, b: number) => {
-		return a + b;
+		return a - b;
 	};
 
killedBy: TestingExampleComponent displays the correct sum result
statusReason: TestingLibraryElementError: Unable to find an element with the text: 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="result"
    >
